package Ch13;

import java.util.Scanner;

public class Ch13 {

	public static void main(String[] args) {
		// 클래스
		// 클래스의 구성
		// 1. 
		
		
		
		
		// 객체(Object) - 존재하는 사물
		// 클래스로부터 만들어진 객체를 클래스의 인스턴스라고 함
		// "객체가 생성된다" = "메모리 공간을 차지한다"
		
		
		// ## 인스턴스화 ##
		// 클래스를 이용하여 객체를 생성하는 가정을 의미
		// new 키워드를 사용하여 클래스를 인스턴스화 가능
		
		
		// ## 객체 선언 방법 ##
		// Person	사람1		= new		Person();
		// 클래스자료형 참조변수명	= new예약어	클래스생성자
		
		
		// 객체의 기본 구조
		// 1. 멤버변수	: 클래스 내부에 선언된 변수, 즉 객체의 속성을 나타냄
		// 2. 메서드	: 클래스 내부에 정의된 함수, 즉 객체의 기능(동작)을 나타냄.
		
		
		
		// 객체 지향 프로그래밍
		// 객체에 대한 모델링을 중심을 하는 프로그래밍 방식
		// 코드를 객체라는 단위로 구성, 객체들 간의 상호 작용을 통해 프로그램을 구축하는 것을 목표
	
		// 객체 지향의 장점:
		// 코드의 재사용성 높음, 개발 속도 향상
		// 코드의 유지보수성 향상
		// 객체간의 관계를 명확하게 표현 가능
		// 소프트웨어의 확정성과 유연성이 높음
	
	}

}
